In [1]:
import pandas as pd
import numpy as np
import config
print(config.version)
print(config.connection_string)
pd.set_option('display.max_columns', None)

3.2.0.Dev
postgresql://postgres:sa@localhost/icip

In [ ]:
sql = """
select ps.id from ps
join tarif t on t.ps_id = ps.id
join tarif_date_source tds on tds.tarif_id=t.id 
join cabinet c on t.cabinet_id = c.id
join adresse_raw ar on c.adresse_raw_id = ar.id
join adresse_norm an on ar.adresse_norm_id = an.id
join specialite_profession sp on sp.profession_id=t.profession_id
where sp.specialite_id=10
and tds.date_source_id >= 2100 and  tds.date_source_id < 2200
group by ps.id
"""
# 54851 ps

In [2]:
sql = f"""
select ps.id, an.lon, an.lat, count(t.id) from ps
join tarif t on t.ps_id = ps.id
join tarif_date_source tds on tds.tarif_id=t.id 
join cabinet c on t.cabinet_id = c.id
join adresse_raw ar on c.adresse_raw_id = ar.id
join adresse_norm an on ar.adresse_norm_id = an.id
join specialite_profession sp on sp.profession_id=t.profession_id
where sp.specialite_id=10
and tds.date_source_id >= 2100 and  tds.date_source_id < 2200
group by ps.id, an.lon, an.lat
"""
stats = pd.read_sql(sql, config.connection_string)
stats

           id       lon        lat  count
0       14434  5.334156  46.049236     72
1       14436  5.249939  46.216705     22
2       14437  4.884658  46.260609     44
3       14438  5.827150  46.108782     66
4       14441  5.127257  46.097351     44
...       ...       ...        ...    ...
58236  156278  0.484606  43.080071      6
58237  156279  6.798160  43.434313      2
58238  156282  4.896624  45.274477     12
58239  156283 -1.192521  48.167752      2
58240  156284  5.400188  43.259766      2

[58241 rows x 4 columns]

In [3]:
stats["count"].describe()

count    58241.000000
mean        48.921911
std         41.797693
min          1.000000
25%         22.000000
50%         40.000000
75%         64.000000
max        722.000000
Name: count, dtype: float64